"""
    格式化输出方法%
%s:为字符占位
%d:为数值类型占位
%f:为浮点数占位
s1 = "%s------%d--------%f-------"%('a','b','c')

    F表达式
"""
a1 = "我%s你"%("爱爱爱")
print(a1)
a2 = "我的考试成绩是%d"%(89)
print(a2)
a3 = "隔壁的数字五分裂成了%f"%(2.5)
print(a3)
a4 = "集合为%s"%([1,2])
print(a4)
print("==============分割线==============")
name="叶盖"
age= 19
s1 = "我的名字是{1},今年{0}岁".format(name,age)
s2 = f"我的名字是{name},今年{age}岁"
print(s1)
print(s2)
print("==============分割线==============")
"""
    len()  :  字符串的长度
    format:格式化输出(进阶)
    
     1.格式化小数长度(四舍五入)    :.2f
     2.将小数以百分比的形式表示    :.2%
"""
s1 = 5.8723741
print("今天雅思考了{:.2f}分".format(s1))
s2 = 0.82734
print("百分比为{1:.3%}".format(s2,s1))
s3 = "            你是个good boy"
print(len(s3))
print("==============分割线==============")
"""

"""













